In [2]:
from urllib import request
import re
import pandas as pd
import urllib.parse as urp
import requests

import csv

In [3]:
def __get_location1__(name,city):  
        my_ak = 'uXuYBYbI90SdKOGSjIqgDnthz6DrkFN4'   
        qurey = urp.quote(name)
        try:
            url = 'http://api.map.baidu.com/place/v2/search?query='+qurey+'&tag='+'&region='+urp.quote(city)+'&output=json&ak='+my_ak
            #print(url)
            req = request.urlopen(url)
            res = req.read().decode()
            lat = pd.to_numeric(re.findall('"lat":(.*)',res)[0].split(',')[0])
            lng = pd.to_numeric(re.findall('"lng":(.*)',res)[0])
            return (lng,lat)  #经度和纬度
        except:
            return 0,0

In [4]:
print(__get_location1__('紫华佳苑','上海'))

(121.543922, 31.278916)

# 58同城

In [4]:
df = pd.read_excel('datasets/58.xls')
df=df.drop(columns=["区","来源","标题","序号","标签"])
sample = df
sample.head()

     价格  室  厅     面积         小区
1  8500  2  2  91.00  明园森林都市滴翠苑
2  2600  2  1  56.07   四元路20弄小区
3  5500  2  2  84.00  明园森林都市滴翠苑
4  6800  1  2  78.00       紫华佳苑
5  2600  2  2  78.50       江海名都

In [5]:
sample['经度']=0
sample['纬度']=0
sample = sample[['经度','纬度','室','厅','面积','价格','小区']]
sample.head()

<ipython-input-5-0c51e9d63006>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  sample['经度']=0
<ipython-input-5-0c51e9d63006>:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  sample['纬度']=0

   经度  纬度  室  厅     面积    价格         小区
1   0   0  2  2  91.00  8500  明园森林都市滴翠苑
2   0   0  2  1  56.07  2600   四元路20弄小区
3   0   0  2  2  84.00  5500  明园森林都市滴翠苑
4   0   0  1  2  78.00  6800       紫华佳苑
5   0   0  2  2  78.50  2600       江海名都

In [6]:
sample['经度']=0
sample['纬度']=0

location = sample['小区']
lng = []
lat = []

for loc in location:
    address=__get_location1__(str(loc),'上海')
    
    while address == (0,0):
        for i in range(10):
            address = __get_location1__(str(loc),'上海')
            if address ==(0,0):
                continue
            else:
                break
        break
    
    lng.append(str(address[0]))
    lat.append(str(address[1]))

sample['经度']=lng
sample['纬度']=lat

sample.head()

                   经度         纬度  室  厅     面积    价格         小区
1  121.46085500000001  31.295211  2  2  91.00  8500  明园森林都市滴翠苑
2  121.44033799999998  31.419139  2  1  56.07  2600   四元路20弄小区
3  121.46085500000001  31.295211  2  2  84.00  5500  明园森林都市滴翠苑
4          121.543922  31.278916  1  2  78.00  6800       紫华佳苑
5  121.44136499999999  31.629754  2  2  78.50  2600       江海名都

In [7]:
sample = sample.drop(columns=["小区"])
sample.to_excel('58_new.xls')

# 贝壳

In [16]:
xlsx = pd.ExcelFile("datasets/beiker.xlsx")
df = pd.read_excel(xlsx, 0)
df1 = pd.read_excel(xlsx, 1)
df2 = pd.read_excel(xlsx, 2)
df3 = pd.read_excel(xlsx, 3)
df = df.append(df1)
df = df.append(df2)
df = df.append(df3)
df = df.drop(columns="序号")
df.head()
df=df.drop(columns=["标题","标签"])
df = df.rename(columns = {'平米': '面积', '地址': '小区'}, inplace = False)
df['经度']=0
df['纬度']=0
df = df[['经度','纬度','室','厅','面积','价格','小区']]
df.head()

   经度  纬度  室  厅  面积    价格           小区
0   0   0  1  1  37  4400     长宁西郊王满小区
1   0   0  2  0  49  4450  徐汇华东理工梅陇十一村
2   0   0  1  1  32  4700     徐汇田林田林六村
3   0   0  1  1  39  4200      徐汇康健寿昌坊
4   0   0  1  1  44  3500     徐汇长桥长桥六村

In [17]:
location = df['小区']
lng = []
lat = []

for loc in location:
    address=__get_location1__(str(loc),'上海')
    
    while address == (0,0):
        for i in range(5):
            address = __get_location1__(str(loc),'上海')
            if address ==(0,0):
                continue
            else:
                break
        break
    
    lng.append(str(address[0]))
    lat.append(str(address[1]))

df['经度']=lng
df['纬度']=lat

df.head()

           经度                  纬度  室  厅  面积    价格           小区
0  121.376976           31.201395  1  1  37  4400     长宁西郊王满小区
1  121.433632  31.138721999999998  2  0  49  4450  徐汇华东理工梅陇十一村
2  121.426847           31.178808  1  1  32  4700     徐汇田林田林六村
3  121.427341  31.157011999999998  1  1  39  4200      徐汇康健寿昌坊
4  121.442889  31.139004999999997  1  1  44  3500     徐汇长桥长桥六村

In [19]:
df=df.drop(columns=["小区"])
df.to_excel('beike_new.xls')

# 安居客

In [11]:
xlsx = pd.ExcelFile("datasets/anjukeFakeHighPrice.xls")
df = pd.read_excel(xlsx, 0)
df = df.drop(columns="序号")
df.head()
df=df.drop(columns=["标题","标签","地址","楼层"])
df = df.rename(columns = {'平米': '面积'}, inplace = False)
df['经度']=0
df['纬度']=0
df = df[['经度','纬度','室','厅','面积','价格','小区']]
df.head()

   经度  纬度   室  厅      面积      价格            小区
0   0   0   7  3  1500.0  400000          汤臣一品
1   0   0  13  6  2700.0  400000  中海紫御豪庭(三期别墅)
2   0   0   9  5   942.0  400000      雁荡路10弄小区
3   0   0   9  3  1155.0  400000        北京西路洋房
4   0   0   6  3   700.0  400000          新华别墅

In [12]:
location = df['小区']
lng = []
lat = []

for loc in location:
    address=__get_location1__(str(loc),'上海')
    
    while address == (0,0):
        for i in range(5):
            address = __get_location1__(str(loc),'上海')
            if address ==(0,0):
                continue
            else:
                break
        break
    
    lng.append(str(address[0]))
    lat.append(str(address[1]))

df['经度']=lng
df['纬度']=lat

df.head()

                   经度                  纬度   室  厅      面积      价格            小区
0  121.50850600000001           31.238794   7  3  1500.0  400000          汤臣一品
1           121.38842  31.232609000000004  13  6  2700.0  400000  中海紫御豪庭(三期别墅)
2          121.476688  31.225751000000002   9  5   942.0  400000      雁荡路10弄小区
3  121.45178999999999  31.232601000000003   9  3  1155.0  400000        北京西路洋房
4  121.43373999999999           31.208144   6  3   700.0  400000          新华别墅

In [13]:
df = df.drop(columns=["小区"])
df.to_excel('anjuke_fake_high.xls')

# Ziroom

In [3]:
xlsx = pd.ExcelFile("datasets/ziroom.xls")
df = pd.read_excel(xlsx, 0)
df.head()
new = []
for i in df["标题"]:
    start=i.find("·")
    end=i.find("室")
    i = i[start+1:end-1]
    new.append(i)
df["标题"] = new
df=df.drop(columns=["标签","地址","楼层"])
df = df.rename(columns = {'标题': '小区'}, inplace = False)
df['经度']=0
df['纬度']=0
df = df[['经度','纬度','室','厅','面积','价格','小区']]
df.head()

   经度  纬度  室  厅      面积     价格      小区
0   0   0  1  1   79.46   8790    新陆花苑
1   0   0  2  1  102.00   9890     光鸿苑
2   0   0  2  1   88.57   9990  宝华城市花园
3   0   0  2  1  143.00  13490    弘辉名苑
4   0   0  2  1  125.75   5390   佳兆业壹号

In [4]:
location = df['小区']
lng = []
lat = []

for loc in location:
    address=__get_location1__(str(loc),'上海')
    
    while address == (0,0):
        for i in range(5):
            address = __get_location1__(str(loc),'上海')
            if address ==(0,0):
                continue
            else:
                break
        break
    
    lng.append(str(address[0]))
    lat.append(str(address[1]))

df['经度']=lng
df['纬度']=lat

df.head()

                   经度                  纬度  室  厅      面积     价格      小区
0          121.499917           31.272381  1  1   79.46   8790    新陆花苑
1          121.521813           31.206273  2  1  102.00   9890     光鸿苑
2  121.47286899999999           31.284688  2  1   88.57   9990  宝华城市花园
3          121.496374  31.208895000000002  2  1  143.00  13490    弘辉名苑
4          121.279576           31.327221  2  1  125.75   5390   佳兆业壹号

In [5]:
df=df.drop(columns=["小区"])
df.to_excel('ziroom_new.xls')

# Lianjia

In [6]:
xlsx = pd.ExcelFile("datasets/lianjia.xls")
df = pd.read_excel(xlsx, 0)
df = df.drop(columns=["序号","标题"])
df.head()

    区1    区2       小区             面积     价格
0   长宁    西郊     王满小区     37㎡南1室1厅1卫   4200
1  NaN   NaN      NaN  22㎡2间在租1室0厅1卫   6750
2   徐汇  上海南站  上中路100弄     37㎡南2室1厅1卫   3800
3  NaN   NaN      NaN  34㎡2间在租1室1厅1卫  15000
4   黄浦   打浦桥     瞿西新村     32㎡南1室0厅1卫   5300

In [8]:
area = []
shi = []
ting = []
for i in df['面积']:
    a = i.find('㎡')
    s = i.find('室')
    t = i.find('厅')
    area.append(i[:a])
    shi.append(i[s-1:s])
    ting.append(i[t-1:t])
df['面积']=area
df['室']=shi
df['厅']=ting
df['经度']=0
df['纬度']=0

df = df[['经度','纬度','室','厅','面积','价格','小区']]
df.head()

   经度  纬度  室  厅  面积     价格       小区
0   0   0  1  1  37   4200     王满小区
1   0   0  1  0  22   6750      NaN
2   0   0  2  1  37   3800  上中路100弄
3   0   0  1  1  34  15000      NaN
4   0   0  1  0  32   5300     瞿西新村

In [9]:
location = df['小区']
lng = []
lat = []

for loc in location:
    address=__get_location1__(str(loc),'上海')
    
    while address == (0,0):
        for i in range(5):
            address = __get_location1__(str(loc),'上海')
            if address ==(0,0):
                continue
            else:
                break
        break
    
    lng.append(str(address[0]))
    lat.append(str(address[1]))

df['经度']=lng
df['纬度']=lat

df.head()

           经度                  纬度  室  厅  面积     价格       小区
0  121.376976           31.201395  1  1  37   4200     王满小区
1  121.439805           31.211437  1  0  22   6750      NaN
2  121.440238  31.143759000000003  2  1  37   3800  上中路100弄
3  121.439805           31.211437  1  1  34  15000      NaN
4  121.477306            31.20324  1  0  32   5300     瞿西新村

In [10]:
df=df.drop(columns=["小区"])
df.to_excel('lianjia_new.xls')